---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.FabricSheetMajorDirectionWireType
source: html/fc21537c-54b5-5834-f7a5-a40cc5897ea9.htm
---
# Autodesk.Revit.DB.ParameterTypeId.FabricSheetMajorDirectionWireType Property

"Major Direction Wire Type": Major Direction Wire Type

## Syntax (C#)
```csharp
public static ForgeTypeId FabricSheetMajorDirectionWireType { get; }
```